EDTMKERPNEW.Разработка/src/InformationRegisters/Разр_ЯрлыкиКоробов/Разр_ЯрлыкиКоробов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Разр_ЯрлыкиКоробов</name>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стерилизован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перемещен</name>
    <type>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTMKERPNEW.Разработка/src/CommonForms/Разр_ВводШтрихкодаМассовый/Module.bsl
&НаКлиенте
Перем Разр_ПринятыеЯрлыки;
&НаКлиенте
Перем Разр_ОбработанныеШтрихкоды;

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Разр_ПринятыеЯрлыки = Новый Массив;
	Разр_ОбработанныеШтрихкоды = Новый Соответствие;

	КоличествоКСканированию = 0;
	КоличествоОтсканировано = 0;
	КоличествоОсталось = 0;
	ТекстОшибок = "";
	
	Штрихкод = "";
	Штрихкоды = "";

	ТекущийЭлемент = Элементы.КоличествоКСканированию;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Значения по умолчанию
	ИмяСобытияОповещения = "НС_ШтрихкодыСчитаныМассово";
	ТекстПодсказки = "Сканируйте штрихкод этикетки ТМЦ.";

	// Если форму открыли с параметрами — используем их
	Если Параметры.Свойство("ИмяСобытияОповещения") Тогда
		ИмяСобытияОповещения = Параметры.ИмяСобытияОповещения;
	КонецЕсли;

	Если Параметры.Свойство("ТекстПодсказки") Тогда
		ТекстПодсказки = Параметры.ТекстПодсказки;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Разр_ОбновитьСчетчикиСканирования()

	КоличествоОтсканировано = Разр_ПринятыеЯрлыки.Количество();
	КоличествоОсталось = КоличествоКСканированию - КоличествоОтсканировано;

	Если КоличествоОсталось < 0 Тогда
		КоличествоОсталось = 0;
	КонецЕсли;

	// После первого принятого штрихкода лучше запретить менять плановое количество
	Если Элементы.Найти("КоличествоКСканированию") <> Неопределено Тогда
		Элементы.КоличествоКСканированию.Доступность = КоличествоОтсканировано = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КоличествоКСканированиюПриИзменении(Элемент)

	Если КоличествоКСканированию < 0 Тогда
		КоличествоКСканированию = 0;
	КонецЕсли;

	Разр_ОбновитьСчетчикиСканирования();

	Если КоличествоКСканированию > 0 Тогда
		ТекущийЭлемент = Элементы.Штрихкод;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыПриИзменении(Элемент)

	Разр_ОбработатьШтрихкодыИзПоля();

КонецПроцедуры

&НаКлиенте
Процедура Разр_ОбработатьШтрихкодыИзПоля()

	Если КоличествоКСканированию <= 0 Тогда
		ПоказатьПредупреждение(, "Сначала укажите количество штрихкодов, которое нужно отсканировать.");
		ТекущийЭлемент = Элементы.КоличествоКСканированию;
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Штрихкоды) Тогда
		Возврат;
	КонецЕсли;

	ТекстШтрихкодов = СтрЗаменить(Штрихкоды, Символы.ВК, "");
	МассивСтрок = СтрРазделить(ТекстШтрихкодов, Символы.ПС);

	БылоПревышение = Ложь;
	КоличествоЛишних = 0;

	Для Каждого СтрокаШтрихкода Из МассивСтрок Цикл

		КодШтрихкода = СокрЛП(СтрокаШтрихкода);

		Если ПустаяСтрока(КодШтрихкода) Тогда
			Продолжить;
		КонецЕсли;

		// Повторно один и тот же штрихкод не обрабатываем
		Если Разр_ОбработанныеШтрихкоды.Получить(КодШтрихкода) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// Контроль превышения количества
		Если Разр_ПринятыеЯрлыки.Количество() >= КоличествоКСканированию Тогда

			Разр_ОбработанныеШтрихкоды.Вставить(КодШтрихкода, Истина);

			БылоПревышение = Истина;
			КоличествоЛишних = КоличествоЛишних + 1;

			Продолжить;

		КонецЕсли;

		Разр_ОбработанныеШтрихкоды.Вставить(КодШтрихкода, Истина);

		// Используем ту же проверку ярлыка, что и в одиночной форме:
		// поиск ярлыка, Отгружен, Стерилизован, признаки номенклатуры и т.д.
		РезультатПроверки = Разр_ПроверитьЯрлыкКоробаПоШтрихкоду(КодШтрихкода);

		Если Не РезультатПроверки.Успех Тогда

			ТекстОшибок = ТекстОшибок 
				+ ?(ПустаяСтрока(ТекстОшибок), "", Символы.ПС)
				+ КодШтрихкода + ": " + РезультатПроверки.ТекстОшибки;

			Продолжить;

		КонецЕсли;

		Разр_ПринятыеЯрлыки.Добавить(РезультатПроверки);

		Разр_ОбновитьСчетчикиСканирования();

	КонецЦикла;

	Если БылоПревышение Тогда
		ПоказатьПредупреждение(,
			"Попытка отсканировать больше заданного количества." + Символы.ПС
			+ "Задано: " + Строка(КоличествоКСканированию) + Символы.ПС
			+ "Принято: " + Строка(КоличествоОтсканировано) + Символы.ПС
			+ "Лишних штрихкодов не принято: " + Строка(КоличествоЛишних));
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьСканирование(Команда)

	// На всякий случай обрабатываем то, что осталось в поле
	Разр_ОбработатьШтрихкодыИзПоля();

	Если КоличествоКСканированию <= 0 Тогда
		ПоказатьПредупреждение(, "Не указано количество штрихкодов к сканированию.");
		Возврат;
	КонецЕсли;

	Если КоличествоОтсканировано < КоличествоКСканированию Тогда
		ПоказатьПредупреждение(,
			"Отсканировано меньше, чем требуется." + Символы.ПС
			+ "Нужно отсканировать: " + Строка(КоличествоКСканированию) + Символы.ПС
			+ "Отсканировано: " + Строка(КоличествоОтсканировано) + Символы.ПС
			+ "Осталось: " + Строка(КоличествоКСканированию - КоличествоОтсканировано));
		Возврат;
	КонецЕсли;

	Если КоличествоОтсканировано > КоличествоКСканированию Тогда
		ПоказатьПредупреждение(,
			"Отсканировано больше, чем требуется." + Символы.ПС
			+ "Нужно отсканировать: " + Строка(КоличествоКСканированию) + Символы.ПС
			+ "Отсканировано: " + Строка(КоличествоОтсканировано));
		Возврат;
	КонецЕсли;

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Ярлыки", Разр_ПринятыеЯрлыки);
	ПараметрыОповещения.Вставить("КоличествоКСканированию", КоличествоКСканированию);
	ПараметрыОповещения.Вставить("КоличествоОтсканировано", КоличествоОтсканировано);

	Оповестить(ИмяСобытияОповещения, ПараметрыОповещения, ЭтаФорма);

	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция Разр_ПроверитьЯрлыкКоробаПоШтрихкоду(Штрихкод)

	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Номенклатура", Неопределено);
	Результат.Вставить("ЭтапПроизводства", Неопределено);
	Результат.Вставить("КоличествоУпаковок", Неопределено);
	Результат.Вставить("Количество", Неопределено);
	Результат.Вставить("Характеристика", Неопределено);
	//Результат.Вставить("АналитикаУчетаНоменклатуры", Неопределено);
	Результат.Вставить("ЗаказКлиента", Неопределено);
	Результат.Вставить("Упаковка", Неопределено);
	Результат.Вставить("Номер", "");
	Результат.Вставить("Отгружен", Ложь);
	Результат.Вставить("Стерилизован", Ложь);
	Результат.Вставить("Назначение", Неопределено);
	Результат.Вставить("Серия", Неопределено);
	Результат.Вставить("АналитикаУчетаНоменклатуры", Неопределено);
	Результат.Вставить("Штрихкод", "");
	Штрихкод = СокрЛП(Штрихкод);
	Результат.Штрихкод = Штрихкод;

	Штрихкод = СокрЛП(Штрихкод);

	Если СтрДлина(Штрихкод) < 26 ИЛИ  СтрДлина(Штрихкод) > 31 Тогда
		Результат.ТекстОшибки = "Некорректная длина штрихкода. Ожидается минимум 26 символов, максимум 31.";
		Возврат Результат;
	КонецЕсли;

	// 1-11 символы — код номенклатуры
	КодНоменклатуры = Сред(Штрихкод, 1, 11);

	// 13-24 символы — код этапа производства
	КодЭтапаПроизводства = Сред(Штрихкод, 13, 12);

	// с 26 символа, длина 6 — порядковый номер
	ПорядковыйНомер = Сред(Штрихкод, 26, 6);

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ярлыки.Номенклатура КАК Номенклатура,
	|	Ярлыки.ЭтапПроизводства КАК ЭтапПроизводства,
	|	Ярлыки.Номер КАК Номер,
	|	Ярлыки.Отгружен КАК Отгружен,
	|	Ярлыки.Стерилизован КАК Стерилизован,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Количество КАК Количество,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка КАК Упаковка,
	|	ЭтапПроизводства2_2ВыходныеИзделия.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Ярлыки.Серия КАК Серия,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ЗаказПереработчику КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.Разр_ЯрлыкиКоробов КАК Ярлыки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ПО Ярлыки.ЭтапПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	|ГДЕ
	|	Ярлыки.Штрихкод = &Штрихкод";

	Запрос.УстановитьПараметр("Штрихкод", СокрЛП(Штрихкод));

	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Результат.ТекстОшибки =
			"Ярлык короба не найден." + СокрЛП(Штрихкод);
		Возврат Результат;
	КонецЕсли;

	// Здесь ярлык найден
	Результат.Номенклатура = Выборка.Номенклатура;
	Результат.ЭтапПроизводства = Выборка.ЭтапПроизводства;
	Результат.ЗаказКлиента = Выборка.ЗаказКлиента;
	Результат.Номер = Выборка.Номер;
	Результат.Отгружен = Выборка.Отгружен;
	Результат.Характеристика = Выборка.Характеристика;
	Результат.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры;
	Результат.КоличествоУпаковок = Выборка.КоличествоУпаковок;
	Результат.Количество = Выборка.Количество;
	Результат.Упаковка = Выборка.Упаковка;
	Результат.Стерилизован = Выборка.Стерилизован;
	Результат.Назначение = Выборка.Назначение;
	Результат.Серия = Выборка.Серия;
	
	Если Результат.Отгружен Тогда
		Результат.ТекстОшибки =
		"Ярлык уже отгружен. Добавление в документ запрещено." + Символы.ПС
		+ "Штрихкод: " + Штрихкод;
		Возврат Результат;
	КонецЕсли;
	
	Если Результат.Стерилизован Тогда
		Результат.ТекстОшибки =
		"Ярлык уже стерилизован. Добавление в документ запрещено." + Символы.ПС
		+ "Штрихкод: " + Штрихкод;
		Возврат Результат;
	КонецЕсли;
	// Проверка признаков номенклатуры
	Если Не Разр_НоменклатураПрошлаПроверкуПризнаков(Выборка.Номенклатура, Результат.ТекстОшибки) Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.Успех = Истина;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция Разр_НоменклатураПрошлаПроверкуПризнаков(Номенклатура, ТекстОшибки)

	ТекстОшибки = "";

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстОшибки = "В ярлыке не заполнена номенклатура.";
		Возврат Ложь;
	КонецЕсли;
	
                     
	Если Не Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция стерильная") 
		И НЕ Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат стерильный") Тогда
		ТекстОшибки = "У номенклатуры не установлен признак: Продукция стерильная или Полуфабрикат стерильный";
		Возврат Ложь;
	КонецЕсли;	

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	КодШтрихкода = СокрЛП(Штрихкод);

	Штрихкод = "";
	ПодключитьОбработчикОжидания("Разр_ВернутьФокусВШтрихкод", 0.1, Истина);

	Если ПустаяСтрока(КодШтрихкода) Тогда
		Возврат;
	КонецЕсли;

	Разр_ОбработатьОдинШтрихкод(КодШтрихкода);
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОбработатьОдинШтрихкод(КодШтрихкода)

	Если КоличествоКСканированию <= 0 Тогда
		ПоказатьПредупреждение(, "Сначала укажите количество штрихкодов к сканированию.");
		ТекущийЭлемент = Элементы.КоличествоКСканированию;
		Возврат;
	КонецЕсли;

	Если Разр_ОбработанныеШтрихкоды.Получить(КодШтрихкода) <> Неопределено Тогда
		ПоказатьПредупреждение(, 
			"Этот штрихкод уже был отсканирован." + Символы.ПС 
			+ КодШтрихкода);
		Возврат;
	КонецЕсли;

	Если Разр_ПринятыеЯрлыки.Количество() >= КоличествоКСканированию Тогда
		ПоказатьПредупреждение(,
			"Нельзя отсканировать больше заданного количества." + Символы.ПС
			+ "Задано: " + Строка(КоличествоКСканированию));
		Возврат;
	КонецЕсли;

	РезультатПроверки = Разр_ПроверитьЯрлыкКоробаПоШтрихкоду(КодШтрихкода);

	Если Не РезультатПроверки.Успех Тогда
		ПоказатьПредупреждение(, РезультатПроверки.ТекстОшибки);
		Возврат;
	КонецЕсли;

	Разр_ПринятыеЯрлыки.Добавить(РезультатПроверки);
	Разр_ОбработанныеШтрихкоды.Вставить(КодШтрихкода, Истина);

	Если ПустаяСтрока(Штрихкоды) Тогда
		Штрихкоды = КодШтрихкода;
	Иначе
		Штрихкоды = Штрихкоды + Символы.ПС + КодШтрихкода;
	КонецЕсли;

	Разр_ОбновитьСчетчикиСканирования();

КонецПроцедуры

&НаКлиенте
Процедура Разр_ВернутьФокусВШтрихкод()

	Если Элементы.Найти("Штрихкод") <> Неопределено Тогда
		ТекущийЭлемент = Элементы.Штрихкод;
	КонецЕсли;

КонецПроцедуры
